oneill2018.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-09-05 Mon 20:14 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Taxation: philosophical perspectives</title>
<meta name="author" content="Rémi Louf" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" /></head>
<body>
<div id="content" class="content">
<h1 class="title">Taxation: philosophical perspectives</h1>
<p>
Questions I hope to answer:
</p>
<ul class="org-ul">
<li>On what basis do we justify taxation and redistribution?
<ul class="org-ul">
<li>Efficiency?</li>
<li>Property rights?</li>
</ul></li>
</ul>

<div id="outline-container-org35238ba" class="outline-2">
<h2 id="org35238ba">Overview</h2>
<div class="outline-text-2" id="text-org35238ba">
<p>
There is a tension between two philosophical views of taxation:
</p>
<ul class="org-ul">
<li><i>Robert Nozick</i> argues that property rights were pre-political, and thus the state cannot interefere with these rights. It should be kept at its strict minimum to enforce these rights; transfers should operate via philantropic work. As a result, <i>Nozick</i> sees taxation as "forced labor". It has a strong influence on contemporary debates. cite:nozick1974</li>
<li><p>
For <i>John Rawls</i>, property rights are not a pre-political constraints on the operation of economical and political institutions, they are creations of the "basic structure" of society. Tax rules are also part of this basic structure. A tax system is just when it contributes to a system that satisfies the principles of justice. In his conception of Justice, Rawls endorses a steeply recipient-oriented inheritance and capital trasnfer tax. cite:rawls2020,rawls1958
</p>

<p>
cite:murphy2002
</p></li>
</ul>
</div>
</div>

<div id="outline-container-org9f95a4e" class="outline-2">
<h2 id="org9f95a4e">Links to this note</h2>
</div>
</div>
</body>
</html>
